In [3]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()

········

In [5]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

## How many distinct (different) actors' last names are there?

data = pd.read_sql_query('SELECT count(distinct last_name) as number_of_last_names_from_actors FROM sakila.actor;', engine)
data.head()

   number_of_last_names_from_actors
0                               121

In [18]:
### Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

data = pd.read_sql_query("""SELECT *,
CASE
WHEN WEEKDAY(rental_date) in (0,1,2,3,4) then 'Weekday'
WHEN WEEKDAY(rental_date) in (5,6) then 'Weekend'
END AS 'Day_of_week'
FROM sakila.rental""", engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,Day_of_week
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Weekday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Weekday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Weekday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Weekday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Weekday

In [19]:
### Get all films with ARMAGEDDON in the title.

data = pd.read_sql_query("""SELECT * FROM sakila.film
WHERE title regexp 'ARMAGEDDON'""", engine)
data.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [23]:
### Get 10 the longest films.

data = pd.read_sql_query("SELECT * FROM sakila.film \
ORDER BY length Desc \
LIMIT 10", engine)
data.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,349,GANGS PRIDE,A Taut Character Study of a Woman And a A Shar...,2006,1,None,4,2.99,185,27.99,PG-13,Behind the Scenes,2006-02-15 05:03:42
1,872,SWEET BROTHERHOOD,A Unbelieveable Epistle of a Sumo Wrestler And...,2006,1,None,3,2.99,185,27.99,R,Deleted Scenes,2006-02-15 05:03:42
2,609,MUSCLE BRIGHT,A Stunning Panorama of a Sumo Wrestler And a H...,2006,1,None,7,2.99,185,23.99,G,Deleted Scenes,2006-02-15 05:03:42
3,817,SOLDIERS EVOLUTION,A Lacklusture Panorama of a A Shark And a Pion...,2006,1,None,7,4.99,185,27.99,R,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42
4,690,POND SEATTLE,A Stunning Drama of a Teacher And a Boat who m...,2006,1,None,7,2.99,185,25.99,PG-13,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [24]:
### How many films include Behind the Scenes content?

data = pd.read_sql_query("""SELECT count(special_features) FROM sakila.film \
WHERE special_features = 'Behind the Scenes'""", engine)
data.head()

   count(special_features)
0                       70

In [26]:
### Which kind of movies (rating) have a mean duration of more than two hours?

data = pd.read_sql_query("""SELECT rating, round(avg(length),2) as avg_length_per_rating \
FROM sakila.film \
group by rating \
HAVING avg_length_per_rating > 120""", engine)
data.head()

  rating  avg_length_per_rating
0  PG-13                 120.44

In [27]:
### Rank films by length (filter out the rows that have nulls or 0s in length column). 
### In your output, only select the columns title, length, and the rank.

data = pd.read_sql_query("""SELECT title, length,
RANK() OVER (
ORDER BY length, title Asc) film_rank
FROM sakila.film
WHERE length IS NOT NULL and length <> 0
""", engine)
data.head()

                 title  length  film_rank
0         ALIEN CENTER      46          1
1            IRON MOON      46          2
2        KWAI HOMEWARD      46          3
3     LABYRINTH LEAGUE      46          4
4  RIDGEMONT SUBMARINE      46          5